
const icons={
    file:`<svg xmlns='http://www.w3.org/2000/svg' viewBox="0 0 1024 1024"><path d="M842.667 981.333H181.333A53.393 53.393 0 0 1 128 928V96a53.393 53.393 0 0 1 53.333-53.333H648.08a52.987 52.987 0 0 1 37.713 15.62L880.38 252.873A52.987 52.987 0 0 1 896 290.587V928a53.393 53.393 0 0 1-53.333 53.333zm-661.334-896A10.667 10.667 0 0 0 170.667 96v832a10.667 10.667 0 0 0 10.666 10.667h661.334A10.667 10.667 0 0 0 853.333 928V298.667h-160A53.393 53.393 0 0 1 640 245.333v-160zM682.667 115.5v129.833A10.667 10.667 0 0 0 693.333 256h129.834zM704 768H320a21.333 21.333 0 0 1 0-42.667h384A21.333 21.333 0 0 1 704 768zm0-213.333H320A21.333 21.333 0 0 1 320 512h384a21.333 21.333 0 0 1 0 42.667zm-213.333-256H320A21.333 21.333 0 0 1 320 256h170.667a21.333 21.333 0 0 1 0 42.667z"/></svg>`,
    attrs:`<svg xmlns='http://www.w3.org/2000/svg' viewBox="0 0 1024 1024"><path d="M288 640C270.08 640 256 654.08 256 672 256 689.92 270.08 704 288 704 305.92 704 320 689.92 320 672 320 654.08 305.92 640 288 640zM288 256C270.08 256 256 270.08 256 288 256 305.92 270.08 320 288 320 305.92 320 320 305.92 320 288 320 270.08 305.92 256 288 256zM288 448C270.08 448 256 462.08 256 480 256 497.92 270.08 512 288 512 305.92 512 320 497.92 320 480 320 462.08 305.92 448 288 448zM768 64 192 64C121.6 64 64 121.6 64 192l0 576c0 70.4 57.6 128 128 128l576 0c70.4 0 128-57.6 128-128L896 192C896 121.6 838.4 64 768 64zM832 768c0 35.2-28.8 64-64 64L192 832c-35.2 0-64-28.8-64-64L128 192c0-35.2 28.8-64 64-64l576 0c35.2 0 64 28.8 64 64L832 768zM672 256l-256 0C398.08 256 384 270.08 384 288 384 305.92 398.08 320 416 320l256 0C689.92 320 704 305.92 704 288 704 270.08 689.92 256 672 256zM672 448l-256 0C398.08 448 384 462.08 384 480 384 497.92 398.08 512 416 512l256 0C689.92 512 704 497.92 704 480 704 462.08 689.92 448 672 448zM672 640l-256 0C398.08 640 384 654.08 384 672 384 689.92 398.08 704 416 704l256 0c17.92 0 32-14.08 32-32C704 654.08 689.92 640 672 640z" p-id="22650"></path></svg>`
}

/**
 * 创建一个容器来保存所有Svg图标
 * @returns 
 */
export function getSvgIconContainer(){
    let svgContainer = document.querySelector("#lite_tree_icons") as HTMLElement
    if(!svgContainer){
        svgContainer = document.createElement("style")
        svgContainer.id="lite_tree_icons"
        svgContainer.innerHTML = `.lite-tree .icon{
            width:1em;
            height:1em;
            margin:0.2em;
        }`
        document.head.appendChild(svgContainer)              
    }    
    return svgContainer
} 

/**
 * 压缩Svg数据，去掉一些无用的数据
 */
const compressRegex = /(\<\?xml(.*)?\?\>)|(\<\!DOCTYPE.*?\>)|(width\=\"\d+\"\s?)|(height\=\"\d+\"\s?)|(\bxmlns(\:\w+)?\=\".*?\"\s?)|(p\-id\=\"\d+\"\s?)|(t\=\"\d+\"\s?)|(version\=\".*?\"\s?)|(class\=\"\w+\"\s?)/gm;
function compressSvgData(svgData:string){
    return svgData.replace(compressRegex,'')
}

/**
 * 注入所有icons文件夹中的图标
 */
export function injectSvgIcons(svgIcons:Record<string,string>){
    const svgIconContainer = getSvgIconContainer()
    for(let [name,define] of Object.entries(icons)){
        const iconClassName = `.icon.${name}`
        const svgData=compressSvgData(define)
            .replaceAll("<","%3C")
            .replaceAll(">","%3E")
            .replaceAll('"',"'")

        const iconStyle = `.lite-tree ${iconClassName}{
            background-image: url("data:image/svg+xml,${svgData}");
        }`;
        if(svgIconContainer.innerHTML.includes(`.lite-tree ${iconClassName}`)) continue
        svgIconContainer.innerHTML = svgIconContainer.innerHTML + "\n" + iconStyle
    }
}

// url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1024 1024'%3E%3Cpath d='M842.667 981.333H181.333A53.393 53.393 0 0 1 128 928V96a53.393 53.393 0 0 1 53.333-53.333H648.08a52.987 52.987 0 0 1 37.713 15.62L880.38 252.873A52.987 52.987 0 0 1 896 290.587V928a53.393 53.393 0 0 1-53.333 53.333zm-661.334-896A10.667 10.667 0 0 0 170.667 96v832a10.667 10.667 0 0 0 10.666 10.667h661.334A10.667 10.667 0 0 0 853.333 928V298.667h-160A53.393 53.393 0 0 1 640 245.333v-160zM682.667 115.5v129.833A10.667 10.667 0 0 0 693.333 256h129.834zM704 768H320a21.333 21.333 0 0 1 0-42.667h384A21.333 21.333 0 0 1 704 768zm0-213.333H320A21.333 21.333 0 0 1 320 512h384a21.333 21.333 0 0 1 0 42.667zm-213.333-256H320A21.333 21.333 0 0 1 320 256h170.667a21.333 21.333 0 0 1 0 42.667z'/%3E%3C/svg%3E")
// url("data:image/svg+xml;%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1024 1024'%3E%3Cpath d='M842.667 981.333H181.333A53.393 53.393 0 0 1 128 928V96a53.393 53.393 0 0 1 53.333-53.333H648.08a52.987 52.987 0 0 1 37.713 15.62L880.38 252.873A52.987 52.987 0 0 1 896 290.587V928a53.393 53.393 0 0 1-53.333 53.333zm-661.334-896A10.667 10.667 0 0 0 170.667 96v832a10.667 10.667 0 0 0 10.666 10.667h661.334A10.667 10.667 0 0 0 853.333 928V298.667h-160A53.393 53.393 0 0 1 640 245.333v-160zM682.667 115.5v129.833A10.667 10.667 0 0 0 693.333 256h129.834zM704 768H320a21.333 21.333 0 0 1 0-42.667h384A21.333 21.333 0 0 1 704 768zm0-213.333H320A21.333 21.333 0 0 1 320 512h384a21.333 21.333 0 0 1 0 42.667zm-213.333-256H320A21.333 21.333 0 0 1 320 256h170.667a21.333 21.333 0 0 1 0 42.667z'/%3E%3C/svg%3E")